/*********************************************************************
    程序名: ex 3-4
    版权:
    作者: 2021212577 沈鸣谦
    日期: 2022-03-09 15:57
    说明:
*********************************************************************/
#include <iostream>
using namespace std;

int main() {
	const double PI = 3.14159265;
	double r;

	r = 1.5;
	cout << "r = 1.5 的圆的周长：" << 2 * PI *r << " m" << endl;
	cout << "r = 1.5 的圆的面积：" << PI *r *r << " m^2" << endl;

	r = 2.4;
	cout << "r = 2.4 的球的体积：" << 4. / 3 * PI *r *r *r << " m^3" << endl;

	return 0;
}

