/*********************************************************************
程序名：百马百瓦问题
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-08-09
说明：
prog3-17.“百马百瓦问题”：有 100 匹马共驮 100 块瓦，其中每匹大马驮 3 块，
每匹小马驮 2 块，每两个马驹驮 1 块。编程求出大马、小马和马驹各有多少匹。
*********************************************************************/
#include <iostream>
#include <cmath>
#include <iomanip>
using namespace std;

int main() {
    int a, b, c, mx = 100;	//大马, 小马, 马驹, 总数

    //解法一：让 a、b 和 c 进行三重循环。注意它们的最大值分别为 mx/3、mx/2 和 mx。
    int num = 0; //解的组数
    for (a = 1; a <= mx / 3; a++)
        for (b = 1; b <= mx / 2; b++)
            for (c = 1; c <= mx; c++)
                if ( (a + b + c == mx) && (a * 3 + b * 2 + c * 0.5 == mx) ) {
                    cout << "大马, 小马, 马驹: " << a << "\t" << b << "\t" << c << "\n";
                    num ++;
                }
    cout << "共有 " << num << " 组解\n\n";

    //解法二：让 a 和 b 进行二重循环。则 c = mx - a - b ，且 c 必为偶数
    num = 0; //解的组数
    for (a = 1; a <= mx / 3; a++)
        for (b = 1; b <= mx / 2; b++)  {
            c = mx - a - b;
            if (c % 2 == 1)
                continue;
            if (a * 3 + b * 2 + c * 0.5 == mx)  {
                cout << "大马, 小马, 马驹: " << a << "\t" << b << "\t" << c << "\n";
                num ++;
            }
        }
    cout << "共有 " << num << " 组解\n\n";
    return 0;
}

