/*********************************************************************
    程序名: ex 2-6
    版权:
    作者: 2021212577 沈鸣谦
    日期: 2022-03-09 15:57
    说明:
*********************************************************************/
#include <iostream>
#include <iomanip>
using namespace std;

int main() {
	cout << "默认格式输出：\n" << 3.14159265 << endl;
	cout << "指定宽度输出：\n" << setw(12) << 3.14159265 << endl;
	cout << "指定精度和宽度输出：\n"
	     << setprecision(8) << 3.14159265 << endl
	     << setw(12) << 3.14159265 << setw(12) << 32767 << endl << endl;
	cout << "默认格式输出：\n" << 314.15900 << endl;
	cout << "定点格式输出：\n" << fixed << 314.15900 << endl;
	cout << "科学记数法格式输出：\n" << scientific << 314.15900 << endl;
	cout << "默认格式输出：\n" << 314.15900 << endl;

	return 0;
}

