/*********************************************************************
    程序名: ex 3-3
    版权:
    作者: 2021212577 沈鸣谦
    日期: 2022-03-09 15:57
    说明:
*********************************************************************/
#include <iostream>
using namespace std;

int main() {
	cout << "变量相关知识测试：" << endl << endl;

	int m, n;
	cout << "定以后未赋初值：m = " << m << "\t n = " << n << "\n\n";

	m = 5;
	n = 5.5;
	cout << "已赋初值：m = " << m << "\t n = " << n << "\n\n";

	m = m + 1;
	cout << "对m再次进行赋值：m = " << m << "\n\n";


	cout << "赋值表达式的值：" << (m = 5) << '\t' << (n = 5.5) << "\n\n";
	//不加括号优先级会出错：
	//cout << "赋值表达式的值：" << m = 5 << '\t' << n = 5.5 << "\n\n";

	cout << "测试复合赋值运算符：\n";
	m -= 4;
	cout << "m -= 4 之后：\t" << m << endl;
	n *= 2;
	cout << "n *= 2之后：\t" << n << endl;
	cout << "\n";

	cout << "测试增量减量运算符的前置和后置写法：\n";
	m = n = 8;
	cout << "m = " << m << "\t n = " << n << endl;
	cout << "++m: " << ++m << endl;
	cout << "n++: " << n++ << endl;
	cout << "m = " << m << "\t n = " << n << endl;

	return 0;
}

